/* 영국의 화폐 단위는 파운드(£)와 펜스(p)이고, 동전의 종류는 아래와 같습니다.
 *
 * 1p, 2p, 5p, 10p, 20p, 50p, £1 (100p), £2 (200p)
 * 이 동전들을 가지고 2파운드를 만드는 방법은 다양할 것입니다. 예를 하나 들면 이렇습니다.
 *
 * 1×£1 + 1×50p + 2×20p + 1×5p + 1×2p + 3×1p
 * 2파운드를 만드는 서로 다른 방법은 모두 몇가지나 있습니까?
 *
 * conins = M원 1,2,5,10,20,50,100,200
 * 점화식 n원(200)이 되는 방법:
 * n원 = M원 동전이 없을때 N을 만드는 가지수 + (N-M)원을 만들때의 가지수
*/

#include <stdio.h>

void main(void)
{
    int coins[8] = {1,2,5,10,20,50,100,200};

    int way[201] = {0};
    way[0] = 1;
    int i,j,index;
    for(i = 0;i<8;i++){
        index = coins[i];
        for(j=index;j<201;j++){
            way[j] = way[j]+way[j - index]; 
        }
    }
    printf("result = %d\n",way[200]);
}
